BUSINESS_TYPE = {
    101: 'مؤســـسة فـــردية',
    102: 'فرع مؤسسة فردية اجنبية',
    201: 'تــــوصية بســـيطة',
    202: 'شركة توصيه بالأسهم',
    203: 'تضــــــــامن',
    204: 'ذات مسئولية محدودة',
    205: 'مساهمة',
    206: 'مساهمة عربية',
    207: 'فرع شركة أجنبية محدودة',
    208: 'فرع شركة أجنبية تضامنية',
    209: 'فرع شركة مساهمة أجنبية',
    210: 'فرع شركة أجنبية توصية بسيطة',
    211: 'توصية بسيطة برأس  مال مختلط',
    213: 'تضامن برأس  مال مختلط',
    214: 'ذات مسئولية محدودة مختلطة',
    215: 'شركة مساهمة مختلطة',
    216: 'مساهمة أجنبية',
    221: 'توصية بسيطة برأس مال أجنبي',
    223: 'تضامن برأس مال اجنبى',
    224: 'محدودة أجنبية',
    225: 'توصيه برأس مال خليجي',
    226: 'تضامن برأس مال خليجي',
    227: 'محدودة برأس مال خليجي',
    228: 'مساهمة برأس مال خليجي',
    701: 'اجنبية تنفيذية متعاقدة اخـرى',
    702: 'مكاتب علمية وفنية',
    703: 'مكاتـب تمثيل',
    704: 'اجنبية استشارية بترخــيص  دائم',
    705: 'اجنبية استشارية بترخيـــص مؤقت',
    706: 'فروع شركات حاصلة على سجل تجارى',
    707: 'فروع شركات اجنبية مرخص  لها',
}

RELATION_TYPE = {
    0: 'غير معرف',
    1: 'مالك المؤسسة',
    2: 'شريك',
    3: 'شريك متضامن',
    4: 'شريك موصى',
    5: 'شريك مؤسس',
    10: 'رئيس مجلس الادارة',
    11: 'نائب رئيس مجلس الادارة',
    12: 'عضو مجلس إدارة',
    13: 'عضو مجلس إدارة منتدب',
    14: 'سكرتير مجلس الادارة',
    15: 'نائب عضو مجلس الادارة المنتدب',
    16: 'سكرتير',
    19: 'نائب مدير',
    20: 'مدير عام',
    21: 'نائب المدير العام',
    22: 'مساعد المدير العام',
    23: 'نائب مساعد المدير العام',
    24: 'مدير',
    25: 'نائب مدير',
    26: 'مدير فرع',
    28: 'مدير مالى',
    29: 'مدير تنفيذى',
    30: 'رئيس مجلس الرقابة',
    31: 'عضو مجلس رقابة',
}

ALLOWED_BUSINESSES = (201, 203, 206)
ALLOWED_RELATIONS = (1, 2, 3, 5, 10, 11, 12, 13, 19, 20, 24, 25, 29)

# CR Info Object Sample:
# {
#   'BusType': 'تــــوصية بســـيطة',
#   'BusTypeID': 201,
#   'CR': '5950011517',
#   'ID': '1024901843',
#   'RelationID': 3,
#   'RelationName': 'شريك متضامن'
# }

# CR Data Object Sample:
# {
#     'Activities': 'تجـارة الجمله والتجزئـه في الكفـرات والأسـاتك والشـنابر ,,,,,,,',
#     'Address': 'نجران - العريسة - شارع الملك عبدالعزيز',
#     'BusType': 'تــــوصية بســـيطة',
#     'BusTypeID': 201,
#     'CR': '5950011517',
#     'CRLocation': 'نجران',
#     'CRLocationID': 5950,
#     'CRNationalNO': None,
#     'Capital': 10001600.0,
#     'CreationDate': '14280126',
#     'ExpiredDate': '14400126',
#     'Fax': '0174727753',
#     'IsMain': False,
#     'Name': 'فرع شركة خالد عبدالله الصافي واخوانة',
#     'POBOX': '000505',
#     'PhoneNumber': '0174727750',
#     'Status': 'ACTIVE',
#     'ZipCode': '11421'
# }

# CR Managers Response Sample:
# [{
#     'BirthYear': '1392',
#     'CR': '5950011517',
#     'ID': '1033277870',
#     'IDIssueDate': '14101224',
#     'Name': 'خالدعيظه احمد ال صالح',
#     'Nationality': 'السعودية',
#     'NationalityID': 1
# }]

# CR Ownerships Response Sample:
# [{
#     'BirthYear': None,
#     'CR': '5950011517',
#     'ID': '          ',
#     'IDIssueDate': None,
#     'Name': None,
#     'Nationality': 'غير معرف',
#     'NationalityID': 0,
#     'RelationID': 4,
#     'RelationName': 'شريك موصى'
# }, {
#     'BirthYear': None,
#     'CR': '5950011517',
#     'ID': '          ',
#     'IDIssueDate': None,
#     'Name': None,
#     'Nationality': 'غير معرف',
#     'NationalityID': 0,
#     'RelationID': 3,
#     'RelationName': 'شريك متضامن'
# }, {
#     'BirthYear': '1377',
#     'CR': '5950011517',
#     'ID': '1024901843',
#     'IDIssueDate': '13990419',
#     'Name': 'خالد عبدالله شيخ الصافي',
#     'Nationality': 'السعودية',
#     'NationalityID': 1,
#     'RelationID': 3,
#     'RelationName': 'شريك متضامن'
# }, {
#     'BirthYear': '1381',
#     'CR': '5950011517',
#     'ID': '1024901850',
#     'IDIssueDate': '13990419',
#     'Name': 'مها حسن طاهر مقيبل',
#     'Nationality': 'السعودية',
#     'NationalityID': 2,
#     'RelationID': 3,
#     'RelationName': 'شريك متضامن'
# }]
