data_cr_related_crs = [
  {
    "CRNo": 1010994569,
    "CRName": "مكتب عبدالمحسن سعد عبدالعزيز سعيد للعقارات",
    "IsMain": 0
  },
  {
    "CRNo": 2050107530,
    "CRName": "مزرعة محمد عبدالله الخفره",
    "IsMain": 0
  },
  {
    "CRNo": 1010542612,
    "CRName": "حلاق حامد محمد صالح دردير للحلاقة",
    "IsMain": 0
  },
  {
    "CRNo": 1010440794,
    "CRName": "مؤسسة الصالحية للاتصالات وتقنية المعلومات",
    "IsMain": 0
  },
  {
    "CRNo": 1011023968,
    "CRName": "مكتب النخلة الاهلية لتاجير السيارات",
    "IsMain": 0
  },
  {
    "CRNo": 1131168428,
    "CRName": "محامص محمد عبدالمعطي احمد الفار للقهوة",
    "IsMain": 0
  },
  {
    "CRNo": 1010542727,
    "CRName": "المركز احمد عبدالمحسن السالم لصيانة السيارات",
    "IsMain": 0
  },
  {
    "CRNo": 1010441609,
    "CRName": "مؤسسة بيبه لتنظيم المعارض  والمؤتمرات",
    "IsMain": 0
  },
  {
    "CRNo": 4030288360,
    "CRName": "فرع مؤسسة الامير فيصل بن مساعد بن سعود ال سعود",
    "IsMain": 0
  },
  {
    "CRNo": 4030288572,
    "CRName": "مصنع المؤسسة السعودية للمياه الصحية والثلج",
    "IsMain": 0
  },
  {
    "CRNo": 1122005573,
    "CRName": "فرع شركة عبدالجليل الفضلي واولاده للتجارة",
    "IsMain": 0
  },
  {
    "CRNo": 1113003786,
    "CRName": "فرع شركة عمر صالح بابكر وشركاه للتموين",
    "IsMain": 0
  },
  {
    "CRNo": 1011023660,
    "CRName": "صيدليةالراجحي السادسةفرع شركةالراجحي الطبيةلاصحابهاابراهيم الراجحي وشريكة",
    "IsMain": 0
  },
  {
    "CRNo": 4650080978,
    "CRName": "فرع شركة الهندسة والابحاث العالمية وشريكه للاستشارات الهندسية",
    "IsMain": 0
  },
  {
    "CRNo": 1010165177,
    "CRName": "مركز عوض علي القحطاني للبصريات",
    "IsMain": 1
  },
  {
    "CRNo": 1010297340,
    "CRName": "مؤسسة عبدالرحمن حمد السريع للتجارة",
    "IsMain": 1
  },
  {
    "CRNo": 1010318575,
    "CRName": "مؤسسة نافذة الموعد لتقنية المعلومات",
    "IsMain": 1
  },
  {
    "CRNo": 1010027796,
    "CRName": "شركة الكترون السعوديه للخدمات",
    "IsMain": 1
  },
  {
    "CRNo": 1010027796,
    "CRName": "فرع شـركة الكترون السعوديه للخدمات",
    "IsMain": 0
  },
  {
    "CRNo": 1010042230,
    "CRName": "شركة اللواء للتجارة والمقاولات",
    "IsMain": 1
  },
  {
    "CRNo": 1010042230,
    "CRName": "مصنع اللواء للمنتجات الاسمنتية",
    "IsMain": 0
  },
  {
    "CRNo": 1010042230,
    "CRName": "فرع اللواء لنقل البضائع",
    "IsMain": 0
  },
  {
    "CRNo": 1010042230,
    "CRName": "مصنع اللواء للمنتجات الاسمنتية",
    "IsMain": 0
  },
  {
    "CRNo": 1010042230,
    "CRName": "فرع شركة اللواء للتجارة والمقاولات",
    "IsMain": 0
  },
  {
    "CRNo": 1010042230,
    "CRName": "فرع شركة اللواء للتجارة والمقاولات",
    "IsMain": 0
  },
  {
    "CRNo": 1010205240,
    "CRName": "شركه اجاده للنظم المحدوده",
    "IsMain": 1
  },
  {
    "CRNo": 1010205240,
    "CRName": "فرع شركة اجاده للنظم المحدودة",
    "IsMain": 0
  },
  {
    "CRNo": 1010205240,
    "CRName": "فرع شركه اجاده للنظم المحدوده",
    "IsMain": 0
  },
  {
    "CRNo": 1010208283,
    "CRName": "شركة مجموعة زاد المعلومات التجارية",
    "IsMain": 1
  },
  {
    "CRNo": 1010208283,
    "CRName": "فرع مجموعة زاد للمعلومات للتجارة",
    "IsMain": 0
  },
  {
    "CRNo": 1010208283,
    "CRName": "فرع شركة زاد المعلومات التجارية",
    "IsMain": 0
  },
  {
    "CRNo": 1010208283,
    "CRName": "فرع شركة مجموعة زاد المعلومات التجارية",
    "IsMain": 0
  },
  {
    "CRNo": 1010208283,
    "CRName": "فرع شركة مجموعة زاد المعلومات التجارية",
    "IsMain": 0
  },
  {
    "CRNo": 1010245397,
    "CRName": "شركه النهر للحلول الامنيه",
    "IsMain": 1
  },
  {
    "CRNo": 1010274808,
    "CRName": "الشركة الدولية للتعليم والتدريب المتقدم",
    "IsMain": 1
  },
  {
    "CRNo": 1010336606,
    "CRName": "شركة الاستشاريون المحترفون للتقنية",
    "IsMain": 1
  },
  {
    "CRNo": 1010359050,
    "CRName": "شركة فاز لتطوير الطاقة",
    "IsMain": 1
  },
  {
    "CRNo": 1010410833,
    "CRName": "شركة بيانات سدير للاتصالات وتقنية المعلومات",
    "IsMain": 1
  },
  {
    "CRNo": 4030151792,
    "CRName": "شركه المحترفون لتنميه الموارد البشريه ( معهد )",
    "IsMain": 1
  },
  {
    "CRNo": 4030151792,
    "CRName": "فرع شركة المحترفون لتنمية الموارد البشرية المحدودة",
    "IsMain": 0
  },
  {
    "CRNo": 4030151792,
    "CRName": "فرع شركة المحترفون لتنمية الموارد البشرية المحدودة",
    "IsMain": 0
  },
  {
    "CRNo": 4030151792,
    "CRName": "فرع شركة المحترفون لتنميه الموارد البشرية",
    "IsMain": 0
  },
  {
    "CRNo": 4030147843,
    "CRName": "شركة المدارج العالميه للتسويق",
    "IsMain": 1
  },
  {
    "CRNo": 4030147843,
    "CRName": "فرع شركه المدارج العالميه للتسويق",
    "IsMain": 0
  },
  {
    "CRNo": 4030147843,
    "CRName": "فرع شركة المدارج العالميه للتسويق",
    "IsMain": 0
  },
  {
    "CRNo": 4030147843,
    "CRName": "فرع شركة المدارج العالمية للتسويق",
    "IsMain": 0
  },
  {
    "CRNo": 1010173173,
    "CRName": "شركه نوكيا سوليوشنز اند نيتوركس برانش اوبريشن او واي",
    "IsMain": 1
  },
  {
    "CRNo": 1010267093,
    "CRName": "فرع شركه اي ام جي اس جروب",
    "IsMain": 1
  },
  {
    "CRNo": 1010162642,
    "CRName": "شركة نوكيا سوليوشنز اند نتويركس  السعودية المحدودة",
    "IsMain": 1
  },
  {
    "CRNo": 1010162642,
    "CRName": "مركز نوكيا السعودية للتدريب",
    "IsMain": 0
  },
  {
    "CRNo": 1010302463,
    "CRName": "شركة ايه تي كيرني السعودية المحدودة",
    "IsMain": 1
  }
]
